import React from 'react';

interface DetailCardProps {
  name: string;
}

interface DetailCardData {
  [key: string]: string;
}

const detailCard: DetailCardData = {
    "villager" : "ชาวบ้าน (Villager) ไล่ล่าหามนุษย์หมาป่าให้เจอและกำจัดทิ้ง **การให้ข้อมูลที่ชัดเจนและสมเหตุสมผลเป็นสิ่งสำคัญ โดยพยายามอ้างอิงต่อสภาพการเล่นในเกมที่ผ่านมาและการตรวจสอบความเชื่อถือกับผู้เล่นอื่น ๆ ",
    "werewolf": "มนุษย์หมาป่า (Werewolf) ในทุก ๆ คืน ตื่นขึ้นมาพร้อมกับมนุษย์หมาป่าตัวอื่น ๆ และเลือกกำจัดผู้เล่นหนึ่งคน **พยายามสร้างภาพลวงให้ชาวบ้านเชื่อว่าคุณไม่ใช่มนุษย์หมาป่า โดยใช้เหตุผลที่น่าเชื่อถือและข้อมูลที่ผิด เพื่อเป็นการปกป้องตัวของคุณเองและเพื่อสร้างความสับสนในค่ายของชาวบ้าน",
    "seer" : "เทพพยากรณ์ (Seer) ในแต่ละคืน เลือกตรวจสอบผู้เล่นหนึ่งคนว่าเป็นมนุษย์หมาป่าหรือไม่ **การใช้ความรู้ของคุณในการตรวจสอบตัวละครของคนอื่นเป็นสิ่งสำคัญ ควรเริ่มต้นด้วยการตรวจสอบคนที่น่าสงสัยมาก่อน",
    "cupid" : "กามเทพ (Cupid) ในคืนแรก เลือกผู้เล่นสองคนให้เป็นคู่กัน หากคนใดคนหนึ่งในคู่นั้นถูกกำจัด อีกคนจะถูกกำจัดไปด้วย **การเชื่อมโยงคู่รักที่เหมาะสมสามารถช่วยให้คุณได้รับความไว้วางใจจากคนที่คุณเชื่อถือได้ ควรพยายามเลือกคู่รักที่จะเชื่อมโยงให้ตั้งใจในการช่วยกันชนะในเกม",
    "bodyguard" : "บอดี้การ์ด (Bodyguard) ในแต่ละคน ให้เลือกผู้เล่นหนึ่งคน ผู้เล่นคนนั้นจะไม่ถูกกำจัดในคืนนั้น (เลือกตัวเองไม่ได้ และไม่สามารถเลือกปกป้องคนเดิมซ้ำ 2 คืนติดกันได้) **ใช้ความสามารถในการปกป้องชาวบ้านที่สำคัญ โดยคุณสามารถเลือกที่จะปกป้องตัวคุณเองหรือคนอื่นในเกมได้ ควรใช้ความสามารถนี้อย่างมีประสิทธิภาพในเวลาที่เหมาะสม",
    "auraseer" : "ญาณทิพย์ (Aura Seer) ในแต่ละคืน ตรวจสอบผู้เล่นหนึ่งคนว่าเป็นตัวละครพิเศษหรือไม่ (ไม่ใช่ทั้งมนุษย์ป่าหมาป่าหรือชาวบ้านธรรมดา เช่น นายพราน  **ในแต่ละคืน ตรวจสอบผู้เล่นหนึ่งคนว่าเป็นตัวละครพิเศษหรือไม่ (ไม่ใช่ทั้งมนุษย์ป่าหมาป่าหรือชาวบ้านธรรมดา เช่น นายพราน))",
    "drunk" : "ขี้เมา (Drunk) คุณเป็นชาวบ้านธรรมดาจนกระทั่งหลังคืนที่ 3 คุณจะสร่างเมาและรู้ตัวว่าจริง ๆ แล้วคุณเป็นใคร (Moderetor เป็นผู้สุ่มบทบาทมาให้) **การใช้สถานะของคุณเพื่อสร้างความสับสนและปกป้องตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรพยายามให้เสียงของคุณเป็นเสียงที่น่าสนใจและไม่เสี่ยงเป็นเป้าหมาย",
    "prince" : "เจ้าชาย (Prince) เมื่อถูกกำจัดด้วยการโหวตในช่วงกลางวัน ให้เผยบทบาทออกมา และจะไม่ถูกกำจัด (หากถูกหมาป่าฆ่าก็จะตายอยู่ดี) **การใช้ความรู้สึกและการตัดสินใจในเวลาที่เหมาะสมสำหรับการใช้สถานะของคุณเป็นสิ่งสำคัญ คุณสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "priest" : "นักบวช (Priest) ในตอนกลางคืน เลือกผู้เล่นหนึ่งคน ผู้เล่นนั้นจะรอพ้นจากการกำจัดได้หนึ่งครั้ง เลือกได้หนึ่งคนต่อเกม **การใช้ความรู้และประสบการณ์ของคุณในการช่วยให้ชาวบ้านเข้าใจสถานะของตัวละครอื่น ๆ ในเกมสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "pi" : "นักสืบเรื่องลี้ลับ (P.I.) ในตอนกลางคืน ให้เลือกชี้ไปที่ผู้เล่นหนึ่งคนเพื่อตรวจดูว่า ผู้เล่นนั้น และผู้เล่นทางซ้ายและทางขวาของผู้เล่นนั้น มีมนุษย์หมาป่าปะปนอยู่หรือไม่ ทำได้หนึ่งครั้งต่อเกม **การใช้ความสามารถในการสืบสวนเกี่ยวกับตัวละครและสถานะของคนอื่น ๆ ในเกมสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "troublemaker" : "ตัวป่วน (Troublemaker) ในตอนกลางคืน คุณสามารถป่วนหมู่บ้าน ให้มีการโหวตกำจัดสองคนในวันรุ่งขึ้น ทำได้หนึ่งครั้งต่อเกม **การใช้ความสามารถในการสร้างความสับสนและปกป้องตัวคุณเองหรือคนที่คุณเชื่อถือได้ ควรใช้ความสามารถนี้อย่างมีประสิทธิภาพในเวลาที่เหมาะสม",
    "witch" : "แม่มด (Witch) ในช่วงกลางคืน คุณสามารถใช้พลังเวทมนตร์เพื่อปกป้องหรือกำจัดผู้เล่นได้อย่างละหนึ่งครั้งในหนึ่งเกม (ชุบคนที่ตายในคืนนั้น หรือ ใช้ยาพิษ **การใช้สกิลของคุณในการช่วยชาวบ้านหรือตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรใช้สกิลของคุณในเวลาที่เหมาะสมและให้ประสิทธิภาพสูงสุด)",
    "oldhag" : "แม่หมอ (Old Hag) ในแต่ละคืน เลือกสาปแช่งผู้เล่นหนึ่งคนให้ออกจากหมู่บ้านไปเป็นเวลาหนึ่งวัน (คนที่ถูกไล่ออกไม่สามารถโหวตได้ และไม่ตกเป็นเป้าหมายในการถูกฆ่าในเช้าวันนั้น) **การใช้สถานะของคุณเพื่อสร้างความสับสนและปกป้องตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรพยายามให้เสียงของคุณเป็นเสียงที่น่าสนใจและไม่เสี่ยงเป็นเป้าหมาย",
    "apprenticeseer" : "ศิษย์เทพพยากรณ์ (Apprentice Seer) หากเทพพยากรณ์ถูกกำจัด คุณจะกลายเป็นเทพพยากรณ์ และตรวจหามนุษย์หมาป่าทุกคืน **การใช้ความรู้ของคุณในการตรวจสอบตัวละครของคนอื่นเป็นสิ่งสำคัญ ควรเริ่มต้นด้วยการตรวจสอบคนที่น่าสงสัยมาก่อน",
    "mayor" : "นายกเทศมนตรี (Mayor) เสียงโหวตของคุณนับเป็น 2 เสียง **การใช้ความรู้สึกและการตัดสินใจในเวลาที่เหมาะสมสำหรับการใช้สถานะของคุณเป็นสิ่งสำคัญ คุณสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "hunter" : "นายพราน (Hunter) ถ้าคุณถูกกำจัด คุณสามารถเลือกกำจัดผู้เล่นอีกคนหนึ่งได้ทันที **ใช้สถานะของคุณเพื่อโจมตีมนุษย์หมาป่าหรือคนอื่นที่คุณคิดว่าเป็นศัตรูของชาวบ้าน ควรพยายามโจมตีเป้าหมายที่น่าสงสัยมากที่สุด",
    "diseased" : "ผู้ป่วยติดเชื้อ (Disease) หากคุณถูกมนุษย์หมาป่ากำจัด มนุษย์หมาป่าจะไม่ได้เลือกกำจัดผู้เล่นในคืนถัดไป **การใช้สถานะของคุณเพื่อสร้างความสับสนและปกป้องตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรใช้สถานะของคุณในเวลาที่เหมาะสมและให้ประสิทธิภาพสูงสุด",
    "pacifist" : "ผู้รักสันติ (Pacifist) คุณต้องโหวตให้ผู้เล่นรอดเสมอ **การใช้สถานะของคุณเพื่อช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า ควรพยายามให้เสียงของคุณเป็นเสียงที่น่าสนใจและไม่เสี่ยงเป็นเป้าหมาย",
    "ghost" : "พรายกระซิบ (Ghost) คุณจะถูกกำจัดตั้งแต่คืนแรก และให้สื่อสารกับผู้เล่นที่เหลือด้วยการส่งสารวันละหนึ่งตัวอักษร **การใช้ความรู้และประสบการณ์ของคุณในการช่วยให้ชาวบ้านเข้าใจสถานะของตัวละครอื่น ๆ ในเกมสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "mason" : "ภราดรแห่งเมสัน (Mason) ในคืนแรก ลืมตาขึ้นมา มองหาภราดรแห่งเมสันด้วยกัน (ต้องมีภราดรแห่งเมสัน อย่างน้อย 2 คนในเกม) **การใช้ความรู้และประสบการณ์ของคุณในการช่วยให้ชาวบ้านเข้าใจสถานะของตัวละครอื่น ๆ ในเกมสามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "doppelganger" : "ภูตจำแลง (Doppelganger) ในคืนแรก เลือกผู้เล่นหนึ่งคน เมื่อผู้เล่นนั้นถูกกำจัด คุณจะสวมรอยเป็นบทบาทนั้นทันที **การใช้สถานะของคุณเพื่อเลือกที่จะเปลี่ยนตัวละครของคุณในเกม ควรพยายามเลือกที่จะเลือกตัวละครที่สามารถช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "lycan" : "ลูกครึ่งมนุษย์หมาป่า (Lycan) คุณอยู่ฝ่ายชาวบ้าน แต่เทพพยากรณ์จะมองเห็นคุณเป็นมนุษย์หมาป่า **การใช้สถานะของคุณเพื่อช่วยให้ชาวบ้านได้รับความไว้วางใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า ควรพยายามให้เสียงของคุณเป็นเสียงที่น่าสนใจและไม่เสี่ยงเป็นเป้าหมาย",
    "toughguy" : "หนุ่มถึก (Tough Guy) หากถูกเลือกกำจัดโดยมนุษย์หมาป่า คุณจะอยู่รอดจนถึงคืนถัดไป (สามารถโหวตได้ และตายในคืนถัดไป) **การใช้สถานะของคุณเพื่อสร้างความสับสนและปกป้องตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรใช้สถานะของคุณในเวลาที่เหมาะสมและให้ประสิทธิภาพสูงสุด",
    "idiot" : "ไอ้ทึ่ม (Villager Idiot) คุณต้องโหวตให้ผู้เล่นถูกกำจัดเสมอ(ทำไงก็ได้ให้คุณโดนโหวตเพื่อชนะ) **การใช้สถานะของคุณเพื่อสร้างความสับสนและปกป้องตัวคุณเองจากการโจมตีของมนุษย์หมาป่า ควรใช้สถานะของคุณในเวลาที่เหมาะสมและให้ประสิทธิภาพสูงสุด",
    "lonewolf" : "มนุษย์หมาป่าเดียวดาย (Lone Wolf) ตื่นพร้อมกับมนุษยืหมาป่าตัวอื่น ๆ ทุกคืน แต่คุณจะชนะเมื่อเหลือรอดอยู่ในเกมเป็นคนสุดท้ายเท่านั้น **ใช้ความสามารถในการโจมตีและฆ่าชาวบ้านเพื่อลดจำนวนคนในเกม โดยพยายามให้เสียงที่เป็นเสียงที่น่าเชื่อถือเพื่อไม่ให้ชาวบ้านตัดสินใจโจมตีคุณก่อน",
    "wolfcup" : "ลูกมนุษย์หมาป่า (Wolf Cup) ในทุก ๆ คืน ตื่นขึ้นมาพร้อมกับมนุษย์หมาป่าตัวอื่น ๆ ถ้าคุณถูกกำจัดฝ่ายมนุษย์หมาป่าจะได้กำจัดผู้เล่น 2 คนในคืนถัดไป **ร่วมมือกับมนุษย์หมาป่าและสนับสนุนเส้นทางการโจมตีของพวกเขา โดยพยายามรู้จักกับเส้นทางการเล่นและการโจมตีที่เหมาะสมในแต่ละเวลา",
    "minion" : "สมุนรับใช้ (Minion) คุณจะรู้ว่าใครเป็นมนุษย์หมาป่าบ้าง แต่ไม่ได้ตื่นในเวลากลางคืน (ลืมตาเฉพาะคืนแรกเพื่อดูว่ามีใครบ้างที่เป็นหมาป่า) ทำงานร่วมกับมนุษย์หมาป่าในการสร้างกลุ่มและสื่อสาร สนับสนุนมนุษย์หมาป่าในการโจมตีและพยายามทำให้ชาวบ้านเชื่อว่าคุณไม่ใช่มนุษย์หมาป่า",
    "sorcerer" : "นางปีศาจ (Sorcerer) ในแต่ละคืน เลือกตรวจสอบผู้เล่นหนึ่งคนว่าเป็นเทพพยากรณ์หรือไม่ คุณอยู่ฝ่ายมนุษย์หมาป่า **ใช้สถานะของคุณในการสร้างความสับสนและปกป้องมนุษย์หมาป่า โดยใช้ความรู้ของคุณในการเลือกเป้าหมายที่เหมาะสมสำหรับการใช้สถานะ",
    "hoodlum" : "อันธพาล (Hoodlum) ในคืนแรก ให้เลือกผู้เล่น 2 คน คุณจะชนะเกมก็ต่อเมื่อคุณยังอยู่ในเกมจนจบเกม และผู้เล่น 2 คนนี้ถูกกำจัดไปแล้ว ** พยายามสร้างความสับสนให้ชาวบ้านโดยใช้ความสามารถของคุณในการโจมตีและการสร้างเหตุการณ์ที่สับสนในเกม",
    "cursed" : "ผู้ต้องคำสาป (Cursed) คุณเริ่มเกมด้วยการอยู่ฝ่ายชาวบ้าน เมื่อมนุษย์หมาป่าเลือกกำจัดคุณ คณจะไม่ตายและกลายเป็นมนุษย์หมาป่าแทน **การใช้สถานะของคุณในการสร้างความสับสนและปกป้องตัวของคุณเองจากการโจมตีของชาวบ้าน ควรพยายามให้เสียงของคุณเป็นเสียงที่น่าสนใจและไม่เสี่ยงเป็นเป้าหมาย",
    "tanner" : "ยาจก (Tanner) คุณหมดอาลัยตายอยากกับชีวิต คุณจะชนะทันทีหากถูกกำจัด **ใช้สถานะของคุณในการสร้างความสับสนและเข้าใจกับผู้เล่นอื่น ๆในเกม พยายามใช้ความเข้าใจเกี่ยวกับการโจมตีของมนุษย์หมาป่าและชาวบ้านเพื่อสร้างสถานการณ์ที่เหมาะสมสำหรับการชนะ",
    "vampire" : "แวมไพร์ (Vampire) ในแต่ละคืน เลือกผู้เล่นหนึ่งคน ผู้เล่นนั้นจะถูกกำจัดเมื่อเริ่มการโหวตกำจัดผู้เล่นในวันถัดไป (มนุษย์หมาป่าไม่สามารถฆ่าแวมไพร์ได้ แต่แวมไพร์สามารถตายจากการโดนโหวตฆ่าได้)**ร่วมมือกับผู้เล่นอื่นในฝ่ายแวมไพร์ในการโจมตีและสร้างสถานการณ์ที่เข้าข่ายในการชนะใช้สถานะแวมไพร์เพื่อสร้างความสับสนและการเปลี่ยนแปลงในเกม",
    "cultleader" : "เจ้าลัทธิ (Cult Leader) ในแต่ละคืน เลือกผู้เล่นหนึ่งคนให้เข้าร่วมลัทธิของตน คุณจะชนะเมื่อผู้เล่นทั้งหมดอยู่ในลัทธิสร้างกลุ่มและการสื่อสารอย่างมีประสิทธิภาพกับสมาชิกในลัทธิเพื่อสร้างแผนการและโจมตีชาวบ้านใช้สถานะเจ้าลัทธิเพื่อสร้างความสับสนและการเชื่อมั่นในกลุ่ม",
    "revealer" : "ผู้เผยตัวตน (Revealer) ในแต่ละคืน สามารถเลือกชี้ผู้เล่นหนึ่งคน หากผู้เล่นนั้นเป็นมนุษย์หมาป่า ผู้เล่นนั้นจะถูกกำจัดทันที แต่ถ้าไม่ใช่ คุณจะถูกกำจัดแทน (หากชี้มนุษย์หมาป่าถูกจะสามารถชี้ต่อได้) ใช้ความสามารถในการเผยแพร่สถานะของตัวเองหรือคนอื่น ๆ เพื่อสร้างความไว้วางใจและความเชื่อมั่นในทีมสร้างสถานการณ์ที่ช่วยให้ชาวบ้านเข้าใจและป้องกันตัวเองจากการโจมตีของมนุษย์หมาป่า",
    "mentalist" : "นักสะกดจิต (Mentalist) ในแต่ละคืน สามารถชี้ไปที่ผู้เล่นสองคนเพื่อตรวจสอบว่าสองคนนั้นอยู่ฝ่ายเดียวกันหรือไม่ ใช้ความสามารถในการสะกดจิตเพื่อตรวจสอบสถานะของผู้เล่นอื่น ๆ และสร้างกลุ่มที่มีความสัมพันธ์แข็งแกร่งกับผู้เล่นที่น่าสงสัยใช้สถานะของคุณเพื่อช่วยให้กลุ่มเข้าใจสถานะและบทบาทของผู้เล่นอื่น ๆ ในเกม",
    "huntress" : "พรานหญิง (Huntress) สามารถกำจัดผู้เล่นได้หนึ่งคนในช่วงกลางคืน ใช้ได้ครั้งเดียวในเกม ใช้ความสามารถในการโจมตีเพื่อสร้างความเสียหายแก่มนุษย์หมาป่าและช่วยให้ชาวบ้านได้รับความไว้วางใจร่วมมือกับผู้เล่นอื่นในการกำจัดศัตรูที่น่าสงสัยและสร้างสถานการณ์ที่ช่วยให้กลุ่มของคุณชนะ",
    "madbomber" : "มือระเบิดพลีชีพ (Mad Bomber) หากถูกกำจัด ผู้เล่นที่อยู่ติดกับคุณทั้งซ้ายและขวาจะถูกกำจัดไปด้วย ใช้สถานะของคุณในการสร้างความสับสนและกำจัดศัตรูโดยใช้การระเบิดเพื่อลดจำนวนผู้เล่นฝ่ายตรงข้ามพยายามใช้การระเบิดให้เป็นประโยชน์สูงสุดต่อทีมของคุณ",
    "mystic" : "เทพผู้รู้แจ้ง (Mystic Seer) ในแต่ละคืน เลือกชี้ผู้เล่นหนึ่งคนเพื่อตรวจสอบว่าเป็นบทบาทใด ใช้ความสามารถในการตรวจสอบสถานะของผู้เล่นอื่น ๆ เพื่อช่วยให้กลุ่มของคุณเข้าใจสถานะและบทบาทของผู้เล่นที่น่าสงสัยสื่อสารกับทีมของคุณเพื่อสร้างแผนการที่เหมาะสมในการต่อสู้กับมนุษย์หมาป่าและชาวบ้าน",
    "alphawolf" : "มนุษย์หมาป่าจ่าฝูง (Alpha Wolf) ในคืนหลังจากที่มีมนุษย์หมาป่าถูกกำจัดในตอนกลางวัน สามารถเลือกเปลี่ยนผู้เล่นที่ฝ่ายมนุษย์หมาป่าเลือกกำจัดให้เป็นมนุษย์หมาป่าตัวใหม่ได้ แทนที่จะกำจัดตามปกติ ใช้ได้ครั้งเดียวในเกม",
    "spellcaster  " : "จอมเวท (Spellcaster) ในแต่ละคืน เลือกผู้เล่นหนึ่งคนให้ห้ามพูดในวันถัดไป **ใช้สถานะของคุณเพื่อช่วยให้ชาวบ้านได้รับความไว้วางใจมากขึ้น โดยใช้สกิลของคุณในการช่วยคุณล่วงหน้าหรือปกป้องตัวคุณและคนในครอบครัวของคุณ สร้างกลุ่มและการสื่อสารอย่างมีประสิทธิภาพกับมนุษย์หมาป่าอื่น ๆ ในฝ่ายของคุณใช้ความสามารถในการโจมตีเพื่อช่วยให้กลุ่มของคุณชนะในเกม"

};

export default function DetailCard({ data }: any) {
  return (
    <div className='flex flex-col text-lg items-center '>
      <label className='text-[20px] font-bold my-5 underline'>ข้อมูลการ์ด</label>
      <div className='text-base '>
        <p><label className='text-sm font-bold pb-5 '>ชื่อการ์ด : </label> {data.title_card}</p>
        <p><label className='text-sm font-bold pb-5 '>วิธีการเล่น : </label>{data.tick_card}</p>
        <p><label className='text-sm font-bold pb-5 '> รายละเอียด : </label>{data.detail_card}</p>
      </div>
    </div>
  );
}